# ElementMulticlassFilter Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementMulticlassFilter Constructor
ElementMulticlassFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementMulticlassFilter(IList<(Of <<'(Type>)>>)) | Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes. |
| ElementMulticlassFilter(IList<(Of <<'(Type>)>>), Boolean) | Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes, with an option to instead match elements whose Element subclass does not match the list of input classes. |

# See Also
ElementMulticlassFilter Class
ElementMulticlassFilter Members
Autodesk.Revit.DB Namespace